//Hooking.cpp
#pragma once
#include "stdafx.h"
#include <windows.h>
#include <iostream>
#include <shlobj.h>
#include <mmsystem.h> //PlaySound
#include "MinHook.h"
#include "Global.h"
#include "Detour.h"
#include "detours/include/detours.h"
#include "D3d11Hook.h"
#include "Hooking/Pools.h"
#include "Hooking/Hook.h"

#pragma comment(lib, "shell32.lib")





std::string input1 = "data";
std::string hash1 = sw::sha512::calculate(input1);

/*
//Init static public members
*/
std::vector<LPVOID>					Hooking::m_hooks;
uint64_t*							Hooking::m_frameCount;
fpIsDLCPresent                      Hooking::is_DLC_present;
fpDrawNotification					Hooking::draw_notification;
fpGetNetworkTime					Hooking::get_network_time;
CPlayers*							Hooking::m_players;
fpStatSetInt						Hooking::stat_set_int;
fpStatSetFloat						Hooking::stat_set_float;
fpStatSetBool						Hooking::stat_set_bool;
fpStatSetDate						Hooking::stat_set_date;
fpStatGetInt						Hooking::stat_get_int;
fpNetworkIsSessionStarted			Hooking::network_is_session_started;
fpSetMobileRadio					Hooking::set_mobile_radio;
fpRequestModel						Hooking::request_model;
fpHasModelLoaded					Hooking::has_model_loaded;
fpSetVehicleForwardSpeed			Hooking::set_vehicle_forward_speed;
fpIsModelValid						Hooking::is_model_valid;
fpIsModelInCdimage					Hooking::is_model_in_cdimage;
fpIsModelAVehicle					Hooking::is_model_a_vehicle;
fpClearPedTasksImmediately			Hooking::clear_ped_tasks_immediately;
fpPtrToHandle						Hooking::ptr_to_handle;

uint64_t	CPattern::virtual_find_pattern(uint64_t address, BYTE *btMask, char *szMask)
{
	MEMORY_BASIC_INFORMATION mbi;
	char*	pStart = nullptr;
	char*	pEnd = nullptr;
	char*	res = nullptr;
	size_t	maskLen = strlen(szMask);

	while (res == nullptr && sizeof(mbi) == VirtualQuery(pEnd, &mbi, sizeof(mbi)))
	{
		pStart = pEnd;
		pEnd += mbi.RegionSize;
		if (mbi.Protect != PAGE_READWRITE || mbi.State != MEM_COMMIT)
			continue;

		for (int i = 0; pStart < pEnd - maskLen && res == nullptr; ++pStart)
		{
			if (byte_compare((BYTE*)pStart, btMask, szMask))
			{
				m_result.push_back(CPatternResult((void*)pStart, mbi.BaseAddress, pEnd));
				res = pStart;
			}
		}

		mbi = {};
	}
	return (uint64_t)res;
}

void	failPat(const char* name)
{
	Log::Fatal("Failed to find %s pattern."_Secure, name);
	exit(0);
}

template <typename T>
void	setPat
(
	const char*	name,
	char*		pat,
	char*		mask,
	T**			out,
	bool		rel,
	int			offset = 0,
	int			deref = 0,
	int			skip = 0
)
{
	T*	ptr = nullptr;

	CPattern pattern(pat, mask);
	pattern.find(1 + skip);
	if (rel)
		ptr = pattern.get(skip).get_rel<T>(offset);
	else
		ptr = pattern.get(skip).get<T>(offset);

	while (true)
	{
		if (ptr == nullptr)
			failPat(name);

		if (deref <= 0)
			break;
		ptr = *(T**)ptr;
		--deref;
	}

	*out = ptr;
	return;
}

template <typename T>
void	setFn
(
	const char*	name,
	char*		pat,
	char*		mask,
	T*			out,
	int			skip = 0
)
{
	char*	ptr = nullptr;

	CPattern pattern(pat, mask);
	pattern.find(1 + skip);
	ptr = pattern.get(skip).get<char>(0);

	if (ptr == nullptr)
		failPat(name);

	*out = (T)ptr;
	return;
}
std::string input4 = "urhegwshghn";
std::string hash4 = sw::sha512::calculate(input4);
/*
//CMetaData
*/
uint64_t	CMetaData::m_begin = 0;
uint64_t	CMetaData::m_end = 0;
DWORD		CMetaData::m_size = 0;

uint64_t	CMetaData::begin()
{
	return m_begin;
}
uint64_t	CMetaData::end()
{
	return m_end;
}
DWORD		CMetaData::size()
{
	return m_size;
}

void		CMetaData::init()
{
	if (m_begin && m_size)
		return;

	m_begin = (uint64_t)GetModuleHandleA(nullptr);
	const IMAGE_DOS_HEADER*	headerDos = (const IMAGE_DOS_HEADER*)m_begin;
	const IMAGE_NT_HEADERS*	headerNt = (const IMAGE_NT_HEADERS64*)((const BYTE*)headerDos + headerDos->e_lfanew);
	m_size = headerNt->OptionalHeader.SizeOfCode;
	m_end = m_begin + m_size;
	return;
}

int FrameCount = 0;
typedef bool(*pIsDlcPresent)(Hash);
pIsDlcPresent OG_IS_DLC_PRESENT = nullptr;
BOOL HK_IS_DLC_PRESENT(Hash hash)
{
	if (FrameCount < *Hooking::m_frameCount) {
		FrameCount = *Hooking::m_frameCount;
		Hooking::onTickInit();
	}
	Hash DlcHash = hash;

	if (DlcHash == 2532323046 || DlcHash == -1762644250) { // DEV
								 // game requested dev dlc -> return true;
		return true;
	}
	else
	{
		return OG_IS_DLC_PRESENT(hash);
	}
	
}



////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*
unitptr_t FindPattern
*/

struct ScriptHeader
{
	char padding1[16];					//0x0
	unsigned char** codeBlocksOffset;	//0x10
	char padding2[4];					//0x18
	int codeLength;						//0x1C
	char padding3[4];					//0x20
	int localCount;						//0x24
	char padding4[4];					//0x28
	int nativeCount;					//0x2C
	__int64* localOffset;				//0x30
	char padding5[8];					//0x38
	__int64* nativeOffset;				//0x40
	char padding6[16];					//0x48
	int nameHash;						//0x58
	char padding7[4];					//0x5C
	char* name;							//0x60
	char** stringsOffset;				//0x68
	int stringSize;						//0x70
	char padding8[12];					//0x74
										//END_OF_HEADER

	bool IsValid() const { return codeLength > 0; }
	int CodePageCount() const { return (codeLength + 0x3FFF) >> 14; }
	int GetCodePageSize(int page) const
	{
		return (page < 0 || page >= CodePageCount() ? 0 : (page == CodePageCount() - 1) ? codeLength & 0x3FFF : 0x4000);
	}
	unsigned char* GetCodePageAddress(int page) const { return codeBlocksOffset[page]; }
	unsigned char* GetCodePositionAddress(int codePosition) const
	{
		return codePosition < 0 || codePosition >= codeLength ? NULL : &codeBlocksOffset[codePosition >> 14][codePosition & 0x3FFF];
	}
	char* GetString(int stringPosition)const
	{
		return stringPosition < 0 || stringPosition >= stringSize ? NULL : &stringsOffset[stringPosition >> 14][stringPosition & 0x3FFF];
	}

};
struct ScriptTableItem
{
	ScriptHeader* Header;
	char padding[4];
	int hash;

	inline bool IsLoaded() const
	{
		return Header != NULL;
	}
};

struct ScriptTable
{
	ScriptTableItem* TablePtr;
